Revit 2027 API
RebarBendData.BarNominalDiameter Property
 Defines the nominal diameter of the bar. The default value is 0.0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarNominalDiameter { get; set; }
Public Property BarNominalDiameter As Double
	Get
	Set
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
member BarNominalDiameter : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for barNominalDiameter is not finite
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace